%% Масса подвижной части оси y
mb = 145.324217; % Масса стола
mf = 34.944012; % Масса пустой колбы
p = 0.659; % Плотность гексана (основной растворитель) г/см^3
V = 25; % Объём колбы см^3
mc = 0.7; % Вес каретки
ma = 19.453662; % Вес переходников
mn = 7.856; % Вес нуля
ms = (7.817 + 7.204 + 0.533671*4)*2 + 0.754968*4; % Вес крепежей
M = mb + (mf + p*V)*16 + mc*2 + ma + mn + ms; % Общий вес подвжижных частей по оси y
%% Характеристики передачи винт-гайка
d = 8; % Диаметр трапециедального винта
S = 2; % Шаг резьбы
Z = 4; % Заходы
S1 = S*Z; % Ход резьбы
betta = atan(S1/(pi*d)); % Угол подъёма резьбы
A = 1/2;